{
    "name": "Arshavir's Page",
    "children": [
        {
            "img": "img/arshavir-small.jpg",
            "value": 80
        },
        {
            "name": "Academic Bio",
            "value": 20,
            "text": [
                "I am a final-year PhD student at ETH~Zurich, supervsed by Prof.~Peter~Müller. I obtained my MSc degree in Computer Science (2015) and my BSc degree in Applied Mathematics and Physics (2013), both from Moscow Institute of Physics and Technology."
            ]
        },
        {
            "name": "Contact",
            "value": 30,
            "text": [
                "ter-gabrielyan АТ inf.ethz.ch",
                "<a href='http://linked.in/Arshavir'>Linkedin</a>",
                "<a href='https://github.com/aterga'>Github</a>",
                "",
                "Universitätsstr. 6",
                "CAB H 83.2",
                "8092 Zürich",
                "Switzerland"
            ]
        },
        {
            "name": "Research Interests",
            "value": 40,
            "text": [
                "I am currently writing a thesis about automated reasoning in the scope of formal program verification. Priorly, I have been building tools for automatically debugging power and performance issues for the Android platform while working at Intel's Strategic CAD Labs. Even earlier, I have worked on optimizing compilers, applying machine learning for automatically tuning compiler optimizations and designing new, scalable optimizations for an explicitely parallel host architecture."
            ],
            "children": [
                {
                    "name": "Modular Software Verification",
                    "value": 1000,
                    "text": [
                        "Read my latest paper: <a href='https://doi.org/10.1145/3360547'>Modular Verification of Heap Reachability Properties in Separation Logic</a>"
                    ]
                },
                {
                    "name": "Automated Formal Reasoning", 
                    "value": 1000,
                    "text": [
                        "Theorem provers. Model finders. Classifiers. What is the common ground?"
                    ]
                },
                {
                    "name": "Verification Debigging", 
                    "value": 3000,
                    "text": [
                        "In modular verification, the development workflow consists of",
                        "(1) writing and debugging the implementation and the specification for each procedure",
                        "and (2) constructing a formal proof that this implementation adheres to its specification.",
                        "The latter problem is addressed by modern program verifiers that automate the workflow", 
                        "and dramatically reduce the burden of constructing formal proofs manually.",
                        "However, writing sound and complete specifications is an inherently hard mathematical problem",
                        "that requires deep interaction between the programmer and the verifier.",
                        "This interaction should be naturally supported by the IDE."
                    ]
                }
            ]
        },
        {
            "name": "Projects",
            "value": 30,
            "text": [
                "I am a member of the <a href='http://viper.ethz.ch/'>Viper project</a>, developing an intermediate language and the infrastructure for formal deductive verification. My main focus is on extending Viper's specification features with advanced properties: heap reachability, comprehensions, etc. I am currently the main developer of <a href='https://www.pm.inf.ethz.ch/research/viper/downloads.html'>Viper~IDE.</a>"
            ]
        },
        {
            "name": "Movies",
            "value": 20,
            "text": [
                "I like to watch movies in my free time. My favorite filmmaker David~Lynch; he's wonderful."
            ]
        }
    ]
}
